# Priprava podatkov

### Oblika podatkov

Poglejmo s kaksno obliko podatkov rokujemo.

In [125]:
import pandas as pd
import os

# Set the directory containing the CSV files
directory = "structured_data/"

# Initialize an empty dictionary to store the DataFrames
data_dict = {}

# Loop through all CSV files in the directory
for filename in os.listdir(directory):
    if filename.endswith(".csv"):
        print("Reading: " + filename)
        # Get the filename without the extension
        name = os.path.splitext(filename)[0]
        filepath = os.path.join(directory, filename)
        # Read the CSV file into a Pandas DataFrame
        df = pd.read_csv(filepath)
        # Append the DataFrame to the dictionary using the filename as the key
        data_dict[name] = df
        
d = None

# Print the dictionary to verify the contents
for key, dataFrame in data_dict.items():
    print(f"Table: {key}, St. vrstic: {len(dataFrame)}")
    display(dataFrame.head(1))

Reading: po-obcinah_izobrazba.csv
Reading: po-obcinah_spol.csv
Reading: po-obcinah_starost.csv
Reading: po-obcinah_trajanje-brezposelnosti.csv
Reading: po-statisticnah-regijah_izobrazba.csv
Reading: po-statisticnah-regijah_spol.csv
Reading: po-statisticnah-regijah_starost.csv
Reading: po-statisticnah-regijah_trajanje-brezposelnosti.csv
Reading: po-uradih-za-delo_izobrazba.csv
Reading: po-uradih-za-delo_spol.csv
Reading: po-uradih-za-delo_starost.csv
Reading: po-uradih-za-delo_trajanje-brezposelnosti.csv
Table: po-obcinah_izobrazba, St. vrstic: 13278

,Občina,OŠ ali manj,srednje poklicno izobraževanje,"strokovno, splošno izobraževanje","izobraževanje prve, druge, tretje stopnje",Skupaj,month,year
0,AJDOVŠČINA,224.0,180.0,173.0,122.0,699.0,JAN,2018

Table: po-obcinah_spol, St. vrstic: 13278

       Občina  Moški  Ženske  Skupaj month  year
0  AJDOVŠČINA  335.0   364.0   699.0   JAN  2018

Table: po-obcinah_starost, St. vrstic: 13278

,Občina,15 do 24 let,25 do 29 let,30 do 39 let,40 do 49 let,50 do 54 let,55 let ali več,Skupaj,month,year
0,AJDOVŠČINA,53.0,86.0,157.0,113.0,111.0,179.0,699.0,JAN,2018

Table: po-obcinah_trajanje-brezposelnosti, St. vrstic: 10698

,Občina,Do 2 mesecev,3 do 5 mesecev,6 do 8 mesecev,9 do 11 mesecev,12 do 23 mesecev,24 do 35 mesecev,36 mesecev ali več,Skupaj,month,year
0,AJDOVŠČINA,158.0,104.0,47.0,34.0,114.0,48.0,194.0,699.0,JAN,2018

Table: po-statisticnah-regijah_izobrazba, St. vrstic: 950

,Kohezijska / Statistična regija,1+2 OŠ ali manj,"3+4 - nižje, srednje poklicno izobr.","5 - srednje tehniško, strokovno, splošno izobr.","6+7+8 - visokošolsko izobr. prve, druge, tretje stopnje",Skupaj,month,year
0,Slovenija,27666.0,23433.0,22082.0,14738.0,87919.0,JAN,2018

Table: po-statisticnah-regijah_spol, St. vrstic: 1178

  Kohezijska / statistična regija    Moški   Ženske   Skupaj month  year
0                       Slovenija  44807.0  43112.0  87919.0   JAN  2018

Table: po-statisticnah-regijah_starost, St. vrstic: 266

,Kohezijska / \nstatistična regija,15-24\nlet,25-29\nlet,30-39\nlet,40-49\nlet,50-54\nlet,55 let \nali več,Skupaj,month,year
0,Slovenija,6038.0,6667.0,14342.0,14486.0,6998.0,19303.0,67834.0,JAN,2022

Table: po-statisticnah-regijah_trajanje-brezposelnosti, St. vrstic: 1178

,Kohezijska / statistična regija,Do 2 meseca,3 do 5 mesecev,6 do 8 mesecev,9 do 11 mesecev,12 do 23\n mesecev,24 do 35\n mesecev,36 mesecev ali več,Skupaj,month,year
0,Slovenija,21974.0,11742.0,6073.0,4469.0,14511.0,6810.0,22340.0,87919.0,JAN,2018

Table: po-uradih-za-delo_izobrazba, St. vrstic: 4412

,Urad za delo,1+2 - OŠ ali manj,"3+4 - nižje, srednje poklicno izobr.","5 - srednje tehniško, strokovno, splošno izobr.","6+7+8 - visokošolsko izobr. prve, druge, tretje stopnje",Skupaj,month,year
0,OS Celje,2906.0,2745.0,2378.0,1449.0,9478.0,JAN,2018

Table: po-uradih-za-delo_spol, St. vrstic: 4412

  Urad za delo   Moški  Ženske  Skupaj month  year
0     OS Celje  4717.0  4761.0  9478.0   JAN  2018

Table: po-uradih-za-delo_starost, St. vrstic: 4412

,Urad za delo,15 do 24 let,25 do 29 let,30 do 39 let,40 do 49 let,50 do 54 let,55 ali več,Skupaj,month,year
0,OS Celje,696.0,1068.0,2007.0,1916.0,1295.0,2496.0,9478.0,JAN,2018

Table: po-uradih-za-delo_trajanje-brezposelnosti, St. vrstic: 4412

,Urad za delo,Do 2 mesecev,3 do 5 mesecev,6 do 8 mesecev,9 do 11 mesecev,12 do 23 mesecev,24 do 35 mesecev,36 mesecev ali več,Skupaj,month,year
0,OS Celje,2297.0,1208.0,591.0,479.0,1612.0,749.0,2542.0,9478.0,JAN,2018

### Normaliziramo imena stolpcev

In [126]:
# make a function that will take all the column names ["OBČINE", "Občina", "OB�INE", "Kohezijska / Statistična regija", "Kohezijska / statistična regija", "Kohezijska / \nstatistična regija", "Urad za delo"]
# and turn those into a new column name "regija"

OBCINA = {"občine", "občina", "ob�ine"}

REGIJA = {"kohezijska / statistična regija", "kohezijska / statistična regija", "kohezijska / \nstatistična regija"}

LETO = {"leto", "year"}

def normaliziraj_imena_stolpcev(df):
    # find all the columns that have the names in REGIJA and create a new column "regija"
    for imeStolpca in df.columns:
        imeStolpcaLower = imeStolpca.lower().strip()
        if imeStolpcaLower in OBCINA:
            df["__obcina"] = df[imeStolpca]
            break
        
        if imeStolpcaLower in REGIJA:
            df["__regija"] = df[imeStolpca]
        
        if imeStolpcaLower in LETO:
            df["__leto"] = df[imeStolpca]
            
for key, dataFrame in data_dict.items():
    normaliziraj_imena_stolpcev(dataFrame)
# Print the dictionary to verify the contents
for key, dataFrame in data_dict.items():
    print(f"Table: {key}, St. vrstic: {len(dataFrame)}")
    display(dataFrame.head(2))
    display(dataFrame.dtypes)

Table: po-obcinah_izobrazba, St. vrstic: 13278

,Občina,OŠ ali manj,srednje poklicno izobraževanje,"strokovno, splošno izobraževanje","izobraževanje prve, druge, tretje stopnje",Skupaj,month,year,__obcina
0,AJDOVŠČINA,224.0,180.0,173.0,122.0,699.0,JAN,2018,AJDOVŠČINA
1,ANKARAN,30.0,28.0,43.0,20.0,121.0,JAN,2018,ANKARAN

Občina                                        object
OŠ ali manj                                   object
srednje poklicno izobraževanje                object
strokovno, splošno izobraževanje              object
izobraževanje prve, druge, tretje stopnje     object
Skupaj                                       float64
month                                         object
year                                           int64
__obcina                                      object
dtype: object

Table: po-obcinah_spol, St. vrstic: 13278

       Občina  Moški  Ženske  Skupaj month  year    __obcina
0  AJDOVŠČINA  335.0   364.0   699.0   JAN  2018  AJDOVŠČINA
1     ANKARAN   54.0    67.0   121.0   JAN  2018     ANKARAN

Občina       object
Moški       float64
Ženske      float64
Skupaj      float64
month        object
year          int64
__obcina     object
dtype: object

Table: po-obcinah_starost, St. vrstic: 13278

,Občina,15 do 24 let,25 do 29 let,30 do 39 let,40 do 49 let,50 do 54 let,55 let ali več,Skupaj,month,year,__obcina
0,AJDOVŠČINA,53.0,86.0,157.0,113.0,111.0,179.0,699.0,JAN,2018,AJDOVŠČINA
1,ANKARAN,3.0,16.0,24.0,29.0,14.0,35.0,121.0,JAN,2018,ANKARAN

Občina             object
15 do 24 let       object
25 do 29 let       object
30 do 39 let       object
40 do 49 let       object
50 do 54 let       object
55 let ali več     object
Skupaj            float64
month              object
year                int64
__obcina           object
dtype: object

Table: po-obcinah_trajanje-brezposelnosti, St. vrstic: 10698

,Občina,Do 2 mesecev,3 do 5 mesecev,6 do 8 mesecev,9 do 11 mesecev,12 do 23 mesecev,24 do 35 mesecev,36 mesecev ali več,Skupaj,month,year,__obcina
0,AJDOVŠČINA,158.0,104.0,47.0,34.0,114.0,48.0,194.0,699.0,JAN,2018,AJDOVŠČINA
1,ANKARAN,36.0,18.0,9.0,9.0,13.0,6.0,30.0,121.0,JAN,2018,ANKARAN

Občina                 object
Do 2 mesecev           object
3 do 5 mesecev         object
6 do 8 mesecev         object
9 do 11 mesecev        object
12 do 23 mesecev       object
24 do 35 mesecev       object
36 mesecev ali več     object
Skupaj                float64
month                  object
year                    int64
__obcina               object
dtype: object

Table: po-statisticnah-regijah_izobrazba, St. vrstic: 950

,Kohezijska / Statistična regija,1+2 OŠ ali manj,"3+4 - nižje, srednje poklicno izobr.","5 - srednje tehniško, strokovno, splošno izobr.","6+7+8 - visokošolsko izobr. prve, druge, tretje stopnje",Skupaj,month,year,__regija,__leto
0,Slovenija,27666.0,23433.0,22082.0,14738.0,87919.0,JAN,2018,Slovenija,2018
1,NaN,NaN,NaN,NaN,NaN,NaN,JAN,2018,NaN,2018

Kohezijska / Statistična regija                             object
1+2              OŠ ali manj                               float64
3+4 - nižje, srednje poklicno izobr.                       float64
5 - srednje tehniško, strokovno, splošno izobr.            float64
6+7+8 - visokošolsko izobr. prve, druge, tretje stopnje    float64
Skupaj                                                     float64
month                                                       object
year                                                         int64
__regija                                                    object
__leto                                                       int64
dtype: object

Table: po-statisticnah-regijah_spol, St. vrstic: 1178

,Kohezijska / statistična regija,Moški,Ženske,Skupaj,month,year,__regija,__leto
0,Slovenija,44807.0,43112.0,87919.0,JAN,2018,Slovenija,2018
1,NaN,NaN,NaN,NaN,JAN,2018,NaN,2018

Kohezijska / statistična regija     object
Moški                              float64
Ženske                             float64
Skupaj                             float64
month                               object
year                                 int64
__regija                            object
__leto                               int64
dtype: object

Table: po-statisticnah-regijah_starost, St. vrstic: 266

,Kohezijska / \nstatistična regija,15-24\nlet,25-29\nlet,30-39\nlet,40-49\nlet,50-54\nlet,55 let \nali več,Skupaj,month,year,__regija,__leto
0,Slovenija,6038.0,6667.0,14342.0,14486.0,6998.0,19303.0,67834.0,JAN,2022,Slovenija,2022
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,JAN,2022,NaN,2022

Kohezijska / \nstatistična regija     object
15-24\nlet                           float64
25-29\nlet                           float64
30-39\nlet                           float64
40-49\nlet                           float64
50-54\nlet                           float64
55 let \nali več                     float64
Skupaj                               float64
month                                 object
year                                   int64
__regija                              object
__leto                                 int64
dtype: object

Table: po-statisticnah-regijah_trajanje-brezposelnosti, St. vrstic: 1178

,Kohezijska / statistična regija,Do 2 meseca,3 do 5 mesecev,6 do 8 mesecev,9 do 11 mesecev,12 do 23\n mesecev,24 do 35\n mesecev,36 mesecev ali več,Skupaj,month,year,__regija,__leto
0,Slovenija,21974.0,11742.0,6073.0,4469.0,14511.0,6810.0,22340.0,87919.0,JAN,2018,Slovenija,2018
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,JAN,2018,NaN,2018

Kohezijska / statistična regija     object
Do 2 meseca                        float64
3 do 5 mesecev                     float64
6 do 8 mesecev                     float64
9 do 11 mesecev                    float64
12 do 23\n mesecev                 float64
24 do 35\n mesecev                 float64
36 mesecev ali več                 float64
Skupaj                             float64
month                               object
year                                 int64
__regija                            object
__leto                               int64
dtype: object

Table: po-uradih-za-delo_izobrazba, St. vrstic: 4412

,Urad za delo,1+2 - OŠ ali manj,"3+4 - nižje, srednje poklicno izobr.","5 - srednje tehniško, strokovno, splošno izobr.","6+7+8 - visokošolsko izobr. prve, druge, tretje stopnje",Skupaj,month,year,__leto
0,OS Celje,2906.0,2745.0,2378.0,1449.0,9478.0,JAN,2018,2018
1,UD Celje,934.0,907.0,864.0,596.0,3301.0,JAN,2018,2018

Urad za delo                                                object
1+2 - OŠ ali manj                                          float64
3+4 - nižje, srednje poklicno izobr.                       float64
5 - srednje tehniško, strokovno, splošno izobr.            float64
6+7+8 - visokošolsko izobr. prve, druge, tretje stopnje    float64
Skupaj                                                     float64
month                                                       object
year                                                        object
__leto                                                      object
dtype: object

Table: po-uradih-za-delo_spol, St. vrstic: 4412

  Urad za delo   Moški  Ženske  Skupaj month  year  __leto
0     OS Celje  4717.0  4761.0  9478.0   JAN  2018    2018
1     UD Celje  1634.0  1667.0  3301.0   JAN  2018    2018

Urad za delo     object
Moški           float64
Ženske          float64
Skupaj          float64
month            object
year              int64
__leto            int64
dtype: object

Table: po-uradih-za-delo_starost, St. vrstic: 4412

,Urad za delo,15 do 24 let,25 do 29 let,30 do 39 let,40 do 49 let,50 do 54 let,55 ali več,Skupaj,month,year,__leto
0,OS Celje,696.0,1068.0,2007.0,1916.0,1295.0,2496.0,9478.0,JAN,2018,2018
1,UD Celje,213.0,360.0,770.0,683.0,421.0,854.0,3301.0,JAN,2018,2018

Urad za delo     object
15 do 24 let    float64
25 do 29 let    float64
30 do 39 let    float64
40 do 49 let    float64
50 do 54 let    float64
55 ali več      float64
Skupaj          float64
month            object
year              int64
__leto            int64
dtype: object

Table: po-uradih-za-delo_trajanje-brezposelnosti, St. vrstic: 4412

,Urad za delo,Do 2 mesecev,3 do 5 mesecev,6 do 8 mesecev,9 do 11 mesecev,12 do 23 mesecev,24 do 35 mesecev,36 mesecev ali več,Skupaj,month,year,__leto
0,OS Celje,2297.0,1208.0,591.0,479.0,1612.0,749.0,2542.0,9478.0,JAN,2018,2018
1,UD Celje,939.0,427.0,214.0,146.0,583.0,232.0,760.0,3301.0,JAN,2018,2018

Urad za delo           object
Do 2 mesecev          float64
3 do 5 mesecev        float64
6 do 8 mesecev        float64
9 do 11 mesecev       float64
12 do 23 mesecev      float64
24 do 35 mesecev      float64
36 mesecev ali več    float64
Skupaj                float64
month                  object
year                    int64
__leto                  int64
dtype: object

In [127]:
# store all the dataframes in shared memory
%store data_dict

Stored 'data_dict' (dict)